{"appnews":{"appid":570,"newsitems":[{"gid":"2444779293783881751","title":"Gabe Newell refuses to say the number 3 in surprisingly funny Dota 2 voice recording","url":"https://steamstore-a.akamaihd.net/news/externalpost/eurogamer/2444779293783881751","is_external_url":true,"author":"","contents":"<img src=\"https://cdn.gamer-network.net/2018/articles/2018-08-22-16-26/-1534951578854.jpg/EG11/resize/300x-1/format/jpg/1991799.jpg\" alt=\"\"/><p>Gabe Newell is the hallowed leader of one of gaming's most powerful companies, Valve, but we don't often see him. He's like some whispered-about deity at the top of a mystical tower. </p><p>Nor do we often see much humour from Valve. It's all serious Steam business these days and Dota 2 and Counter-Strike GO. But, hold your breath, here's a new Dota 2 video from Valve which does something about that.</p><p>The video features Gabe Newell recording voice lines - Mega-Kills Announcer lines - for Dota 2. He's in a recording booth and he's being prepped for what should be an easy hour's work. Except, he's awful - he's as wooden as a door and can't stop introducing himself before delivering the lines. Some lines he can't even say. His avoiding the word \"three\" - yes it's the Half-Life 3 meme in action - is a wonder to behold.</p><p><a href=\"https://www.eurogamer.net/articles/2018-08-22-gabe-newell-dota-2-voice-over\">Read more&hellip;</a></p>","feedlabel":"Eurogamer","date":1534953149,"feedname":"eurogamer","feed_type":0,"appid":570},{"gid":"2444779293783405217","title":"Gabe Newell steps up to the mic in new Dota 2 voice pack","url":"https://steamstore-a.akamaihd.net/news/externalpost/rps/2444779293783405217","is_external_url":true,"author":"contact@rockpapershotgun.com (Alice O'Connor)","contents":"<p><a href=\"https://assets.rockpapershotgun.com/images/2018/08/dota-2-gabe.jpg\"><img src=\"https://assets.rockpapershotgun.com/images/2018/08/dota-2-gabe.jpg/RPSS/resize/670x-1/format/jpg/\" width=\"670\" /></a></p>\n<p>With over $25 million (  19m) now in the prize pool for <a href=\"https://www.rockpapershotgun.com/game/dota-2/\">Dota 2</a>&#8216;s The International tournament, Valve need a certain level of hype and energy to match that. Enter Gabe Newell, the softly-spoken CEO, knife-collecting uncle,  and megacorp mascot. A new voice pack for Dota 2 has Newell deadpan through announcing large numbers of murders, delivering lines including &#8220;Megakill&#8221;, &#8220;Monsterkill&#8221;, &#8220;More than two kills but less than four kills&#8221;, &#8220;Ownage&#8221;, and &#8220;Please e-mail me at gaben@valvesoftware.com and let me know about your rampage&#8221; with characteristic drama. See him bring the energy to the booth in this video skit below.</p>\n<p> <a href=\"https://www.rockpapershotgun.com/2018/08/22/gabe-newell-dota-2-voice-pack/#more-582183\" class=\"more-link\"><span aria-label=\"Continue reading Gabe Newell steps up to the mic in new Dota 2 voice pack\">(more&hellip;)</span></a></p>\n","feedlabel":"Rock, Paper, Shotgun","date":1534938109,"feedname":"rps","feed_type":0,"appid":570},{"gid":"2444779293782996821","title":"Gabe Newell comes to Dota 2 in wonderfully deadpan voice pack","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2444779293782996821","is_external_url":true,"author":"","contents":"<iframe src=\"https://www.youtube.com/embed/CEGMccdFWDw\"></iframe>\n<p>Gabe Newell has come to <a href=\"https://www.pcgamer.com/dota-2/\" target=\"_blank\">Dota 2</a> in the form of a new deadpan voice pack, with lines including: &quot;Please email me at GabeN@valvesoftware.com and let me know about your rampage&quot;. It&apos;s truly excellent.</p><p>It&apos;s far funnier than I was expecting&#x2014;the trailer above is basically a sketch showing Newell rehearsing the lines (and refusing to say the number three, for obvious reasons). I think my favourite is: &quot;This is Gabe Newell. Thanks for playing Dota 2. Double Kill.&quot;</p><p>The voice pack is included in Dota 2&apos;s The International Battle Pass, which costs $10. 25% of all sales of the Battle Pass go straight into The International prize pool, which currently sits at a whopping $25 million. You can also pay to level up the Battle Pass if you want extra rewards,&#xA0;</p><p>If you just want to hear the voice lines, then YouTuber DotaBoyz has put together a video of them, which you can see below. Hat tip, <a href=\"https://www.gamespot.com/articles/gabe-newell-voice-pack-for-dota-2-announced-watch-/1100-6461323/\" target=\"_blank\">Gamespot</a>.</p>\n<iframe src=\"https://www.youtube.com/embed/QeDYhhjuRgM\"></iframe>\n<p>OpenAI&apos;s team of five self-teaching AI bots are set to <a href=\"https://www.pcgamer.com/openais-dota-2-bot-will-play-three-rounds-at-the-international-2018/\"><u>take on a team of pros at this year&apos;s The International</u></a>, with the first match of three kicking off today. &#xA0;&#xA0;</p>","feedlabel":"PC Gamer","date":1534930612,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2444779293780881977","title":"Steam expands its broadcasting features, starting with The International 2018 live on SteamTV","url":"https://steamstore-a.akamaihd.net/news/externalpost/rps/2444779293780881977","is_external_url":true,"author":"contact@rockpapershotgun.com (Dominic Tarason)","contents":"<p><img src=\"https://assets.rockpapershotgun.com/images/2018/08/dota2.jpg/RPSS/resize/670x-1/format/jpg/\" width=\"670\" /></p>\n<p>While Twitch still seems a popular venue to watch <a href=\"https://www.rockpapershotgun.com/game/dota-2/\">Dota 2</a> mega-tourney <a href=\"https://www.rockpapershotgun.com/tag/the-international-2018/\">The International</a>, Valve have <a href=\"http://blog.dota2.com/2018/08/the-main-event-with-new-steam-broadcasting/\">rolled out a few upgrades to Steam Broadcasting</a>. If it tickles your fancy, you can now watch the massive esport event on <a href=\"https://steam.tv/dota2/\">SteamTV</a>, complete with Steam friends integration and the option to invite your regular Dota posse to watch the match with you in a private chat (text or voice) instance. While focused on Dota 2 for now &#8211; introducing some game-specific features to the streaming interface &#8211; Valve plan on extending &#8220;Watch Party&#8221; features to all games after the tourney.<br />\n <a href=\"https://www.rockpapershotgun.com/2018/08/21/steam-tv-live-broadcasting-dota-2/#more-582063\" class=\"more-link\"><span aria-label=\"Continue reading Steam expands its broadcasting features, starting with The International 2018 live on SteamTV\">(more&hellip;)</span></a></p>\n","feedlabel":"Rock, Paper, Shotgun","date":1534876934,"feedname":"rps","feed_type":0,"appid":570},{"gid":"2444779293777720160","title":"Valve's new streaming website, Steam.tv, is officially live now","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2444779293777720160","is_external_url":true,"author":"","contents":"<p></p>\n<p>Late last week, Steam.tv <a href=\"https://www.pcgamer.com/valve-launches-streaming-website-steamtv/\">popped into existence</a> and then quickly popped out, but not before the internet noticed that Valve had silently launched a new streaming website&#x2014;cuing speculation that it plans to take on Twitch. Today, Valve has properly launched Steam.tv.</p><p>If you head to <a href=\"http://steam.tv/\" target=\"_blank\">Steam.tv</a> now, you&apos;ll find a live broadcast of the 2018 Dota 2 International, and some nice, simple features. You can scrub through the stream like you can during YouTube livestreams, and even better, team fights are marked on the timeline so you can jump to the highlights. You can also log in with your Steam account and either join the main chat, or create group chats with folks from your Steam friends list.</p><p>Watching pro Dota 2 is, of course, not where Valve plans to stop with Steam.tv and in-client broadcasting. &quot;This Dota 2 centered update to Steam Broadcasting currently includes some custom elements to support The International,&quot; reads <a href=\"http://blog.dota2.com/2018/08/the-main-event-with-new-steam-broadcasting/?tg_rhash=ef812bf2b658b4\" target=\"_blank\">Valve&apos;s blog post</a>. &quot;After the tournament we plan to extend Watch Party support for all games that are broadcasting on Steam and expose a new broadcast Steamworks API to Steam partners.&quot;</p><p>With such a big library of games and massive user count, Valve has a lot of power to improve on livestreaming here. If it can make streaming more convenient via reliable tools within the Steam client, and also give developers lots of room to customize how their games are streamed (the Dota 2 highlight markers are presumably just the beginning), it may be a real force in the scene. One place Valve doesn&apos;t have as much experience, however, is in Twitch&apos;s monetization plans&#x2014;though I don&apos;t doubt Valve can figure out how to make and share money, as it does in the Steam Marketplace (and just by selling games, of course, which streaming promotes).</p><p>We&apos;ll keep a close eye on new developments as Valve expands its broadcasting platform.</p>","feedlabel":"PC Gamer","date":1534804075,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2444779293777581552","title":"OpenAI's Dota 2 bot will play three rounds at The International 2018","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2444779293777581552","is_external_url":true,"author":"","contents":"<p></p>\n<p>Earlier this month, OpenAI Five, a Dota bot created by the engineers at non-profit AI research company OpenAI, <a href=\"https://www.pcgamer.com/how-the-openai-five-tore-apart-a-team-of-dota-2-pros/\" target=\"_blank\"><u>destroyed a team</u></a> of top-level Dota 2 players. Back in 2017, a more primitive version of the AI <a href=\"https://www.pcgamer.com/elon-musk-heralds-the-future-of-ai-as-a-dota-2-bot-beats-a-human-champ/\" target=\"_blank\"><u>crushed a Dota pro</u></a> in a 1v1 fight. This week, that same AI will play three matches at The International Dota 2 championship. &#xA0;</p><p>Before you start preparing for a gray goo-esque apocalypse, know this: the bot isn&apos;t actually competing in the championship, it&apos;s just playing in some exhibition matches as part of The International&apos;s &quot;special events.&quot; OpenAI Five will play on Wednesday, August 22; Thursday, August 23; and Friday, August 24. You can find the full schedule <a href=\"http://www.dota2.com/international/schedule/8/0/?l=english\" target=\"_blank\"><u>here</u></a>.&#xA0;</p><p>God help the players up against the bot. As OpenAI explained in <a href=\"https://blog.openai.com/openai-five/\" target=\"_blank\"><u>a blog post</u></a>, the bot &quot;plays 180 years worth of games against itself every day, learning via self-play.&quot; When our own Morgan Park spoke to MoonMeander, one of the players who recently lost to OpenAI Five, he told us it&apos;s impossible to beat the bot mechanically, and that human opponents will only stand a chance if they &quot;use the fog and items and skillsets in a way it won&apos;t expect.&quot;</p><p>Even if they are just for fun, OpenAI Five&apos;s matches at The International will be something to see&#x2014;but you may want to temper any hopes of an upset.</p>","feedlabel":"PC Gamer","date":1534800694,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2444779293775412245","title":"A team of Dota 2-playing AI bots beat the pros - and now they're gunning for more","url":"https://steamstore-a.akamaihd.net/news/externalpost/eurogamer/2444779293775412245","is_external_url":true,"author":"","contents":"<img src=\"https://cdn.gamer-network.net/2018/articles/2018-08-16-14-19/a-team-of-ai-bots-beat-dota-2-pros-at-their-own-game-so-whats-next-1534425566036.jpg/EG11/resize/300x-1/format/jpg/1990631.jpg\" alt=\"\"/><p>On 5th August, five expert Dota 2 players sat down to play against a team of bots created by non-profit research lab OpenAI. They lost decisively. Just a few days from now that same team of bots, perhaps with the benefit of a few more weeks of training, will appear on stage at the biggest tournament in Dota 2 - The International - and play against a team of the world's best professional players. Winning there that would be a huge victory, a milestone for both AI and the games industry, and after seeing the bots' performance earlier this month it seems like the most likely outcome. You might be forgiven for feeling like this was the end of an era for game AI as we know it.</p><p>It all feels a bit sudden, too. At last year's International tournament OpenAI were a surprise appearance, turning up to show off their bot that could play 1v1 Mid - a simpler custom game mode for two players - and beat top professionals. It was an impressive display, but it also felt like the kind of game an AI would be naturally good at. It was simple, short, with very clear goals and a lot of emphasis on reaction time. The real challenge, everyone pointed out, would be playing the full game.</p><p>OpenAI's bots don't play the full game quite yet, but less than 12 months later they are surprisingly close, far closer than myself or many of my peers would have guessed they'd be this time last year. With a few notable game mechanics disabled, and only 18 of the 115 heroes available to play, <a href=\"https://www.twitch.tv/videos/293517383\" target=\"_blank\">the bots nevertheless exhibit precise calculation</a>, aggressive fighting styles and an unstoppable sense of momentum. When they're not exhibiting superhuman skill, they're throwing out decade-old Dota 2 conventions and finding new ways to play heroes, distribute resources and take objectives.</p><p><a href=\"https://www.eurogamer.net/articles/2018-08-16-a-team-of-ai-bots-beat-dota-2-pros-at-their-own-game-so-whats-next\">Read more&hellip;</a></p>","feedlabel":"Eurogamer","date":1534750652,"feedname":"eurogamer","feed_type":0,"appid":570},{"gid":"2444779293773571273","title":"Dota 2 Update - August 19th, 2018","url":"https://store.steampowered.com/news/43099/","is_external_url":false,"author":"Valve","contents":"- Fixed a bug with the interaction of Undying's respawn talent and Wraith King's Aghanim's Scepter upgrade.<br>- Fixed a bug with Windranger's Sylvan Vedette and her Focus Fire ability.","feedlabel":"Product Update","date":1534705620,"feedname":"steam_updates","feed_type":0,"appid":570},{"gid":"2444779293768353192","title":"Valve accidentally launches Steam.tv early","url":"https://steamstore-a.akamaihd.net/news/externalpost/eurogamer/2444779293768353192","is_external_url":true,"author":"","contents":"<img src=\"https://cdn.gamer-network.net/2018/articles/2018-08-18-09-27/valve-accidentally-launches-steam-tv-early-1534580874105.jpg/EG11/resize/300x-1/format/jpg/1990979.jpg\" alt=\"\"/><p>Overnight, Valve accidentally launched Steam.tv - what looks like a take on Twitch - early. The company pulled the website offline shortly after, but not before people got a chance to play around with it.</p><p><a href=\"https://www.cnet.com/news/steam-tv-is-live-and-it-appears-to-be-valves-twitch-competitor/\" target=\"_blank\">Cnet</a> went hands-on with Steam.tv in the hour or so that it was online, and said it was showing The International - the big Dota 2 tournament that's going on right now.</p><p>Accessible via Steam.tv is the new Steam Chat friends list and group chats, Cnet reports, and you're able to watch videos with friends. There's voice chat, too.</p><p><a href=\"https://www.eurogamer.net/articles/2018-08-18-valve-accidentally-launches-steam-tv-early\">Read more&hellip;</a></p>","feedlabel":"Eurogamer","date":1534581864,"feedname":"eurogamer","feed_type":0,"appid":570},{"gid":"2444779293767366163","title":"Valve launches streaming website Steam.tv (Updated)","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2444779293767366163","is_external_url":true,"author":"","contents":"<p></p>\n<p><strong>Update 2 (Aug 20):</strong> It&apos;s <a href=\"https://steam.tv/dota2/\" target=\"_blank\">live again</a>, and it looks like <a href=\"http://blog.dota2.com/2018/08/the-main-event-with-new-steam-broadcasting/?tg_rhash=ef812bf2b658b4\" target=\"_blank\">it&apos;s staying up this time</a>.</p><p><strong>Update: </strong>A Valve rep has confirmed that <a href=\"https://steam.tv/\">Steam.tv</a> is real, it&apos;s in testing, and you weren&apos;t supposed to see it. &quot;We are working on updating Steam Broadcasting for the Main Event of <a href=\"http://www.dota2.com/international/overview/\">The International</a>, Dota 2&#x2019;s annual tournament,&quot; the rep said. &quot;What people saw was a test feed that was inadvertently made public.&quot;</p><p>The International 2018 Main Event is scheduled to run August 20-25, so assuming that all goes reasonably well, we should be getting a proper look at Steam.tv soon.</p><p><strong>Original story:</strong></p><p>Earlier today, <a href=\"https://twitter.com/thexpaw/status/1030540388417847301\" target=\"_blank\">a tweet</a> from Pavel Djundik pointed us to the domain <a href=\"https://steam.tv/\" target=\"_blank\">Steam.tv</a>, but at that time it was a blank site which simply read &quot;Welcome to Steam.tv.&quot; A glance at the certificate showed it to be a legitimate Valve website, which was curious, but not quite enough to report. While we&apos;ve suspected that Valve has Twitch dreams in its eyes, all we could do was speculate.</p><p>Later this evening, though, Valve apparently launched <a href=\"https://steam.tv/\" target=\"_blank\">Steam.tv</a> with a livestream of <a href=\"http://www.dota2.com/international/overview/\" target=\"_blank\">The International 2018</a> and chat bar. <a href=\"https://www.cnet.com/news/steam-tv-is-live-and-it-appears-to-be-valves-twitch-competitor/\" target=\"_blank\">Cnet says</a> that it&apos;s just the Dota 2 stream for now, and that you can log into your Steam account and access your friends list for group chats. It also has voice chat support in Chrome.</p>\n<figure><p></p><figcaption><p>Screenshot <a href=\"https://www.cnet.com/news/steam-tv-is-live-and-it-appears-to-be-valves-twitch-competitor/\" target=\"_blank\">via Cnet</a>.</p></figcaption></figure>\n<p>I&apos;ll have to take Cnet and <a href=\"https://kotaku.com/valve-launches-steam-tv-which-could-be-a-twitch-compet-1828431411\" target=\"_blank\">Kotaku</a>&apos;s word for all that, because all I see is a blank page. I&apos;ve tried coming at Steam.tv from a few locations via VPN just in case any region-targeting is going on, but still, nothing. Either the news spread fast enough to overwhelm the site, or Valve just took it down after a bit of fun.&#xA0;</p><p>Whatever the case, this seems to be a very limited test of a website that expands on Steam&apos;s streaming functionality, creating a more Twitch-like experience for viewers. We don&apos;t know how far Valve plans to take it, but it&apos;s a safe bet that it won&apos;t be limited to Dota 2 streams.&#xA0;</p><p>We&apos;ll let you know if Valve says anything about its Friday night tinkering.</p>","feedlabel":"PC Gamer","date":1534801847,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2454911758759679878","title":"Dota 2 Update - August 14th, 2018","url":"https://store.steampowered.com/news/42938/","is_external_url":false,"author":"Valve","contents":"* Fixed a bug where Morphling's Morph was triggering Aftershock.<br>* Added a new webpage where you can set your fantasy lineup and check your points during The International: http://www.dota2.com/fantasy","feedlabel":"Product Update","date":1534279800,"feedname":"steam_updates","feed_type":0,"appid":570},{"gid":"2454911758756050440","title":"Dota 2 Update - August 13th, 2018","url":"https://store.steampowered.com/news/42902/","is_external_url":false,"author":"Valve","contents":"* Fixed Ball Lightning refunding too much mana when spam clicking it while already in ball lightning.<br>* Fixed a rare bug with Alchemist stun malfunctioning with high amounts of cooldown reduction.","feedlabel":"Product Update","date":1534187640,"feedname":"steam_updates","feed_type":0,"appid":570},{"gid":"2454911758754867797","title":"The precarious business of living off modding","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2454911758754867797","is_external_url":true,"author":"","contents":"<p>For a lot of PC gaming&#x2019;s history, modders have played an instrumental role, collectively building the foundations for many of its cathedrals, such as Counter-Strike, PUBG and League of Legends, as well as the details, from hats to resolution fixes. Modding was the throbbing engine that gave PC gaming its vibrant and dynamic soul.&#xA0;</p><p>But something&#x2019;s changed. Modding isn&#x2019;t the only way hobbyist game makers can express their ideas any more. Cheap and free game engines make it much more straightforward to build games from scratch, and the likes of itch.io and Steam give new developers a place to sell them. What&#x2019;s more, big modern games are so much more complex and harder to mod than ever before, and they&#x2019;re usually given constant updates, including new features which would once have been the province of mods.</p><p>And yet at the same time, today modders have greater support than ever. With the rise of Patreon and programmes that give official commercial support has come the opportunity to legitimately make a living through modding. But it remains a precarious business. We talked to four modders who are making money from their craft.</p>\n<h3>Julio NIB: Making a living in Grand Theft Auto</h3>\n<p></p>\n<p>If you want to play GTA 5 as the Hulk, leaping to a flying helicopter and smashing it to the ground before grabbing a lamppost to wield as a baseball bat, Julio NIB is your modder. Or perhaps you want to play as Thanos, throwing meteors, creating black holes, and able to instantly kill half the local population. Julio NIB, real name Julio Schwab, makes scripts that open up new behaviours and add new characters to Rockstar&#x2019;s urban playground, making it react to fan desires and hot memes.&#xA0;</p><p>He&#x2019;s added Dragon Ball&#x2019;s Kamehameha and Genki Dama attacks, controllable drones from Tom Cruise sci-fi vehicle Oblivion, Crysis suit powers, complete with the same control interface, and Ghost Rider. His body of mods is eclectic, and it&#x2019;s his job. For eight to 10 hours, six or seven days a week, he works on his mods from his home in Maring&#xE1; in southern Brazil, taking 3D models made by other modders like Quechus13, Rarefacer, MadBreaker, and breathing life into them.</p><p>And it comprises his entire income. Schwab runs his modding through <a href=\"https://www.patreon.com/JulioNIB\" target=\"_blank\">Patreon</a>, where he has 3,079 patrons. $2 buys you the access you need to be able to download his released mods, and $10 will give access to in-development ones.</p><p>He won&#x2019;t say exactly how much he makes each month, but you can make a lowball guess if you assume each patron pays the minimum $2. That&#x2019;s a tidy income, especially for someone living in Maring&#xE1;, where living costs are two thirds cheaper than New York City. &#x201C;If I earn US$1000 a month, I earn more than the Brazilian base salary.&#x201D;</p>\n<p></p>\n<p>He&#x2019;s not entirely happy that they&#x2019;re locked behind Patreon&#x2019;s VIP system, but without it he wouldn&#x2019;t have a business. &#x201C;Unfortunately this is how things work,&#x201D; he says. &#x201C;Because the mods were completely free before, I was earning mainly with ads in my <a href=\"https://gtaxscripting.blogspot.com/\"><u>blog</u></a>, but lot of users use AdBlocker and lot of people re-upload my work.&#x201D;</p><p>And using Patreon hasn&#x2019;t gone down well with all his audience. &#x201C;Even more after setting VIP content.&#x201D; But he doesn&#x2019;t care too much. &#x201C;I don&apos;t have time to care.&#x201D; He&#x2019;s trying to build up his output from one mod per month to two in order to gain more patrons and live up to their expectations. It&#x2019;s a cadence that&#x2019;s putting great pressure on him, but with his income has come the chance to invest in better hardware and reason to work out better production methods.</p><p>And what about Rockstar? And Marvel, and all the other holders of the IP Schwab plays with? The VIP system puts him in danger of being accused of selling mods, which would lose any legal protections they might have from fair use. But he&#x2019;s not worried, figuring his work is only encouraging GTA 5&#x2019;s sales.&#xA0;</p><p>&#x201C;Some people say they&#x2019;re only still playing GTA 5 because of my mods, others say they bought the game just to use my mods. Suing me because I&#x2019;m creating my own scripts without stealing anything from the game, only bringing more into the game and more interest from users, wouldn&apos;t be an intelligent idea. But if they do, I will still mod while I can.&#x201D;</p>\n<h3>ARK Star: Going legit in StarCraft 2</h3>\n<p></p>\n<p>In April, Blizzard launched StarCraft 2&#x2019;s Premium Arcade, a series of custom maps sold through Blizzard&#x2019;s own storefront and from inside the game. Its first two games both cost $5: Direct Strike, an established two-player custom game, and ARK Star, which is quite a departure from the essentials of StarCraft. It&#x2019;s a full singleplayer RPG featuring turn-based tactical combat. Polished to a sheen and boasting a full storyline, classes to upgrade and gear to equip, it feels like an entirely separate commercial game.</p><p>ARK Star is the culmination of an ambition that got its creator, Daniel &#x2018;Pirate&#x2019; Altman, into serious modding. Way back in 2009 he caught a discussion during a panel at Blizzcon about the idea of a premium mod marketplace, and it stuck with him. &#x201C;It planted the idea of how cool it would be to earn spare cash making small games,&#x201D; he says.&#xA0;</p><p>So, when he graduated from his degree in forensics, rather than enter the police force, he went into modding, working as a bartender, on and off, to keep himself solvent. He soon carved out a name for singleplayer custom games, first with Facility 17. &#x201C;It ended up being one of the first really popular singleplayer arcade games, back in the day&#x2014;for about a week. All in the game racked up several hundred thousands of hours played.&#x201D;</p><p>The first money he earned through StarCraft 2 modding was in 2012, when he answered an ad to make a custom map that&#x2019;d serve as a wedding proposal. &#x201C;It was actually kind of cute. The game started in this roller derby arena made out of SCII props, representing where they had their first date, and then it gets attacked by Zerg, and there&#x2019;s a chase sequence, and an Ultralisk drops a ring. I remember him being very happy with the end product, but you know, I&#x2019;m not sure I ever heard how the proposal went over.&#x201D;</p><p>More contracts came in from gamers who wanted their own modes and game studios who wanted to rapidly prototype ideas, as well as projects for Blizzard. &#x201C;These kinds of jobs tend to pay a fair rate, but they tend to come few and far between.&#x201D; The most recent contract Altman did was to make <a href=\"http://starcraft.wikia.com/wiki/Axiom_(mod)\" target=\"_blank\">Axiom Mod</a> for TotalBiscuit.</p>\n<p></p>\n<p>In 2015 Altman won Blizzard&#x2019;s Rock the Cabinet mod contest with <a href=\"https://www.youtube.com/watch?v=Iay_Bmg-6Dw\" target=\"_blank\">DWARVEN COMBAT</a>, earning $10,000. Its success set his sights more firmly on making his own stuff, compounded when Blizzard got in touch to see if he&#x2019;d be interested in making one of the first games for Premium Arcade. And so he kicked off ARK Star, going as far as hiring a composer, 2D artist and level artist.</p><p>Over its development, modding became his life. He quit his bartending job and worked 50-60 hours a week for the final year. &#x201C;I felt like it was my big chance to prove myself as a game designer, and could either use the opportunity to either start a small series of games, or finally break into the games industry. If ARK Star really takes off I&#x2019;d love to rent an office in a coworking space and try to maintain a bit of a better work-life balance.&#x201C;</p><p>But, so far, ARK Star hasn&#x2019;t really taken off in that way, and Altman&#x2019;s contract work earned better. &#x201D;StarCraft 2 modding as a source of income has not been financially viable for me,&#x201D; he says. &#x201C;My attempts at marketing the game so far have been pretty unsuccessful. While I approached development like making a standalone indie game, I don&#x2019;t think the community sees it like this. Lack of visibility is compounded by having to download a 28GB client to play the game, leaving ARK Star in a pretty tough spot.&#x201D;</p>\n<h3>Roshpit Champions: Jungling in Dota 2</h3>\n<p></p>\n<p>One of the biggest and most ambitious custom games for Dota 2 is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=469311655\" target=\"_blank\">Roshpit Champions</a>, a multiplayer action RPG that features Dota 2&#x2019;s heroes raiding dungeons and claiming hot loot drops. It&#x2019;s a big game, and made by one person, a Toronto-based programmer called Ryan Racioppo.</p><p>It&#x2019;s a huge project, quite enough to keep him busy working on it full-time for two years. Roshpit Champions is in Dota 2&#x2019;s Custom Game Pass programme, through which players can pay $1 a month to unlock stash and save slots and raise item drop chances by 50%. But that&#x2019;s not its bottom line.&#xA0;</p><p>Most income comes from roshpit.ca, a website which features an auction house which allows players to buy and sell virtual Roshpit items and gives the opportunity to buy a <a href=\"https://www.roshpit.ca/web-premium\" target=\"_blank\">Web Premium pass</a>, which gives additional site features and makes members&#x2019; in-game icons glow to show they&#x2019;re supporting the game. That&#x2019;s the only connection between roshpit.ca and the game itself. &#x201C;Customers are totally okay with it, they appreciate the value it gives and that it supports the game,&#x201D; says Racioppo.</p><p>Things started out well. &#x201C;The first month, wow, it was insane. I was thinking I could do it full-time. There was a ton of attention and so many players were buying passes. Then the second month was all right, and then it dropped off and it hit a trough. Then I started steadily increasing it.&#x201D;&#xA0;</p>\n<p></p>\n<p>But when Racioppo started streaming for donations to buy food, that was the point he realised that things weren&#x2019;t really working out. He got a job as a programmer at a local eSports company, and immediately saw players noticing that content wasn&#x2019;t being added any more. It was frustrating, knowing he couldn&#x2019;t satisfy the demand for the game he&#x2019;d made.&#xA0;</p><p>So he arranged a part-time contract with his remarkably understanding boss (who also tolerates him being active on the game&#x2019;s Discord all day), and since April he&#x2019;s been working Monday to Wednesdays at his job, and then the rest of the time on Roshpit Champions. &#x201C;I just released a big content patch, and revenue went up immediately, so I know how to keep people engaged. It&#x2019;s just that I&#x2019;m the only developer.&#x201D;</p><p>Racioppo first got into modding Warcraft 3 during his teens, but he never saw it as a vocation. He went to university to study accounting, and found it so boring that he decided to learn how to program. And what better way to explore his new skillset than by realising a dream he had for a Diablo-like set in Dota 2, his favourite game?&#xA0;</p><p>But he&#x2019;s at the mercy of Dota 2&#x2019;s popularity. While we talk, he checks its player count, noting that it&#x2019;s down 12% since the same time last year. &#x201C;If I was going to rely on this as my only income, you never know, Valve could just shut down modding, maybe, if it&#x2019;s stopping them developing the engine or something. I&#x2019;m completely dependent on their whims.&#x201D; When he was full-time on Roshpit Champions, he simply figured that if the game was good, Valve would have no reason to pull the plug.</p><p>For now, then, Roshpit Champions is a fulfilling and large-scale side project. &#x201C;I see the money as more of a justification. I would love to be full-time, but obviously there&#x2019;s not enough money in it.&#x201D; But he&#x2019;s still trying to grow it. &#x201C;We&#x2019;ll see where it&#x2019;s at in the next couple of years.&#x201D;</p>\n<h3>Team Radious: Openness in Total War</h3>\n<p></p>\n<p>Team Radious is a community of modders for the Total War series, creating translation patches, custom units, tweaked effects and complete overhauls for Rome 2, Attila, Thrones of Britannia and the Warhammer games. Like all modding, it started as a hobby 12 years ago for its lead, Jan, who by day works at the Czech Social Security Administration. But as Total War has become more complex, so too has the job of modding it.</p><p>&#x201D;Overhauls are massive modifications which require hundreds or thousands of hours, and more for updates and support once they are released,&#x201D; he says. That means bringing in outside expertise, hence the whole &#x2018;Team&#x2019; Radious thing. &#x201C;Video makers, picture makers, unit cards, UI modding, graphics and textures, database and scripting. I can maybe handle a lot, but definitely can&#x2019;t handle all.&#x201D;</p><p>With the work steadily rising in scope, in early 2017 he turned to Patreon, <a href=\"https://www.patreon.com/Team_Radious/\" target=\"_blank\">where 286 patrons</a> now give the team $1,470 a month. Unlike most Patreon modders, like Julio NIB, Team Radious doesn&#x2019;t restrict mod access to patrons. &#x201C;Our mods and everything we do always been, is and always will be entirely free for everyone,&#x201D; Jan says. &#x201C;We are not selling anything. Patreon is just a platform where people if they wish can support our work.&#x201D;&#xA0;</p>\n<p></p>\n<p>Of course, Patreon has introduced overhead of its own. It needed promoting, so Team Radious opened up social media accounts, which all need to be updated and maintained, and its tiers of support, which range from $1 to $70, open up insights into the team&#x2019;s roadmaps and give chances to vote on future decisions. Jan estimates he now spends 40% of his time managing community matters, which also include organising events and quizzes, game nights and community votes, taking in feedback and giving support. &#x201C;All this of course takes additional amount of time which we already do not have to waste.&#x201D;</p><p>One of the ways he manages community expectations is being transparent and open. &#x201C;So everyone can see how much we get, what are our goals are.&#x201D; And that extends to the team itself, with the Patreon money&#x2014;as well as other donations that come in via PayPal&#x2014;divided up according to who did what. &#x201C;It&#x2019;s clearly visible for every member so there are no troubles or hidden things.&#x201D;</p><p>Still, despite these pressures, Jan remains as engaged as ever, working to raise the quality of Team Radious&#x2019; output higher while avoiding letting it affect the rest of his life. &#x201C;Even after 12 years there are always new things to learn and to try,&#x201D; he says. &#x201C;The moment I don&#x2019;t like it anymore I will stop, because without passion and love for this work you can&#x2019;t create really good content which hundreds or thousands of players will play.&#x201D;</p>","feedlabel":"PC Gamer","date":1534164222,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2454911758748577248","title":"How the OpenAI Five tore apart a team of Dota 2 pros","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2454911758748577248","is_external_url":true,"author":"","contents":"<p></p>\n<p>Last weekend, five very good Dota 2 players gathered in San Francisco to play a competitive match&#x2014;against a computer. Their opponent was OpenAI Five, five neural networks which have been training a <em>bit</em> harder than the average Dota player to learn how to be a competitive team: &quot;OpenAI Five plays 180 years worth of games against itself every day, learning via self-play,&quot; says the OpenAI blog. I had no idea who would win, but I wanted to be there in person to find out.</p>\n<figure><blockquote><p>If you try to beat it mechanically, it   s not possible. You   d have to use the fog and items and skillsets in a way it won   t expect.</p><figcaption><cite>MoonMeander</cite></figcaption></blockquote></figure>\n<p>Some people at the event thought OpenAI would have some clear weak points that could be exploited by its human opponents. Others worried the humans would stand no chance against the quicker mind of the machine. Most people I talked to just said &#x201C;I really don&#x2019;t know what to expect,&#x201D; with that excited and anxious feeling that comes with a good mystery.</p><p>This benchmark event was a big deal for OpenAI, a non-profit company co-founded by Elon Musk. It was the first time their Dota 2 AI would be stepping into the spotlight since The International 2017, where it was able to defeat legendary pro player Dendi in a 1v1 showdown. That was impressive, fans agreed, but it wasn&#x2019;t &#x201C;real&#x201D; Dota. Now, a year later, the AI has advanced enough to take on high-level players in a more realistic 5v5 format with some tweaked rules and a limited hero pool of 18.</p><p>Before the match, the players comprising Team Humans (Blitz, Cap, Merlini, MoonMeander, and Fogged) were excited about going up against an AI. Most of them are former pro players who have since moved to professional casting, but their overall MMR still places them in the 99.95th percentile of Dota 2 players. If OpenAI could beat them, it&#x2019;d be significant.</p>\n<p>&#x201C;If you try to beat it mechanically, it&#x2019;s not possible. You&#x2019;d have to use the fog and items and skillsets in a way it won&#x2019;t expect,&#x201D; said MoonMeander. The team agreed that the laning phase would be the hardest challenge in the match. &#x201C;If [the AI] is as good as it was in the 1v1 with perfect denies, then we need to make sure it doesn&#x2019;t snowball out of control,&#x201D; he added.</p><p>When asked what they think their chances were, the group was unsure. &#x201C;Not zero,&#x201D; said Merlini with a laugh. Fogged chimed in lightheartedly with &#x201C;20 percent, come on!&#x201D; MoonMeander didn&#x2019;t want to say for sure, but said, &#x201C;I do think that we stand a chance. I feel like there are some aspects of the game that the bot can&#x2019;t achieve, but we have to outplay them big time to win this.&#x201D;</p><p>OpenAI staff were also hesitant to call the match for sure, but they were feeling good about the progress the AI had made. &#x201C;We&#x2019;re feeling strong, but to be honest, it could go either way,&#x201D; said OpenAI technical staff Filip Wolski. &#x201C;The value of this match is seeing how the bot plays against really good humans.&#x201D;</p><p>As the first match began, all eyes were on the AI. It wasn&#x2019;t long before the humans&#x2019; fears were confirmed. The AI had a knack for instigating fights with precision and speed. By ten minutes in, the AI was leading in kills 13 to 4 with a consistently higher net worth. The humans put up a good fight with some smart takedowns here and there, but were consistently unable to deal with the AI when coordinating as a group. In the clip below, you can see the level of precise action the humans had to deal with as OpenAI turns a fight initiated by Fogged into a team wipe in its favor.</p>\n<p>After the team wipe, the writing was on the wall. Following another big failed defense at their base, Team Humans called &#x201C;GG&#x201D; at the 21-minute mark.</p><p>Going into game 2, we got to take a look behind the curtain of the AI&#x2019;s decision-making process during the team draft, including which heroes it thought the humans would choose, with a percentage chance attached to each. By the time the rosters were decided, the AI predicted a 76 percent chance for victory. But after a strong start in the opening minutes, it shot up to 92 percent.</p><p>Match 2 was mostly more of the same, with the humans trying to keep up and learn the quirks of their artificial opponent. They were able to put up a much better fight in the laning phase this time around, better utilizing the areas of play the AI wasn&#x2019;t great at reacting to. This worked especially well in the clip below, in which a well-timed fissure blocked the path of the AI. Instead of trying to escape, the AI stood there, perhaps confused about what just happened but nonetheless aware of its imminent demise.</p>\n<p>The AI also showed a lack of intuition when it came to invisibility and warding. On several occasions the humans were able to disengage with invisibility with little resistance and the AI would often place wards in awkward spots that weren&#x2019;t useful in the situation. This is a weakness that OpenAI is more than aware of and is working to improve with future iterations.&#xA0;</p><p>Tricking the AI only got the human team so far. After 20 minutes, the AI&#x2019;s heroes had snowballed into powerhouses with more than double the kill count. Victory came after 24 minutes, but this time, the crowd was less enthused. It was a good showing, sure, but at this point the whole thing was starting to feel a little unfair.</p>\n<figure><blockquote><p>With a lot of teams, they   ll walk up and think    wait, are we stronger, are we better than them?    It would just instantly start attacking.</p><figcaption><cite>Fogged</cite></figcaption></blockquote></figure>\n<p>The festivities concluded after a lighthearted third match that allowed the Twitch chat to draft the AI team this time around. After choosing an awful composition, the AI put its chances at about 2.9 percent. And it was right on the money as the humans were able to secure a pretty easy victory. To the crowd, which had gone from cheering for the &#x201C;little AI that could&#x201D; to a complete &#x201C;down with the robots&#x201D; demeanor, the third match was somewhat cathartic. It was a heavily qualified victory, sure, but an appreciated morale boost against our future AI overlords.</p><p>Sitting down to chat after the day was done, Fogged, MoonMeander, and Merlini had a lot to unpack. &#x201C;With a lot of teams, they&#x2019;ll walk up and think &#x2018;wait, are we stronger, are we better than them?&#x2019; No, [the AI] would just instantly know,&#x201D; Fogged said. &#x201C;It would just instantly start attacking, pushing in, and wrap around behind you and kill you.&#x201D;</p><p>After three matches, they had begun to see some patterns in how the AI prioritized certain targets. But in their eyes, a lot of it came down the AI having no hesitation&#x2014;no fear. Merlini recounted, &#x201C;We didn&#x2019;t expect them to dive so much. I got dove right as the first creep wave hit&#x2014;that doesn&#x2019;t happen so often in normal play. It kinda takes a while to get used to.&#x201D;</p><p>MoonMeander brought up an especially poignant moment during the second match that indicated just how far beyond human the AI was playing. &#x201C;There was one time when I was about to fissure kill a Lion and the courier came at the frame-perfect moment, delivered a salve, and it instantly used it. No way a human could have done that. No way.&#x201D; You can watch this moment below. Fogged was quickly able to pick up the kill afterwards.</p>\n<p>Merlini also pointed to the lack of illusions and something that helped the AI. &#x201C;[The AI] never had to guess whether or not somebody is real. &#x2018;Should we waste our spells on them?&#x2019; No, it would just know &#x2018;this is a player, we&#x2019;re killing them&#x2019; every single time.&#x201D; The players initially thought that illusions weren&#x2019;t allowed because the AI would have a tough time telling real players apart, but they later learned that OpenAI thought it would be too hard on the humans. There were concerns that the AI would be able to perfectly control multiple units at a time in a way that a human never could.</p><p>Team Humans wasn&#x2019;t convinced that they would ever be able to best the AI under the same conditions. &#x201C;I&#x2019;d say if they draft, we&#x2019;d have probably a five percent chance,&#x201D; Fogged said. &#x201C;I think if somehow we got the chances to fifty-fifty, that would be the coolest game ever.&#x201D; When asked how OpenAI Five could ultimately be used in the future, MoonMeander sees it as a training tool more than anything else. &#x201C;If they manage to get it to play with all the heroes and all the items in the game, as a pro player, I would like my team to scrim against it. Not a whole game, but a scrim for the first ten minutes to see how strong our lineup is for the laning phase. To see what it takes to counter our heroes.&#x201D;</p><p>For OpenAI, the Dota project has always been about challenging the AI to self-learn using one of the most complicated games in the world. Overall, they&#x2019;re aiming to build the best AGI (artificial general intelligence) they can. &#x201C;On the road there, we try to pick problems that will bring us closer to that general intelligence. In this particular case, with Dota 2, it&#x2019;s a very complex environment where nobody before was able to get AI [to this point] before,&#x201D; said Wolski after the match.</p>\n<p></p>\n<p>Even if the Dota AI goes on to beat the very best players in the world, technical staff member Jie Tang thinks that won&#x2019;t be the end. &#x201C;I think the algorithms and ideas behind it we&#x2019;ll continue working on for a while. It&#x2019;s going to be about picking the next challenge that may be impossible, but not too impossible and trying to see how much traction we can make on it,&#x201D; he said. &#x201C;There&#x2019;s a whole wide world of human capabilities that we can start to tackle one by one.&#x201D;</p><p>When asked if the AI has a chance against pros in The International 2018, Fogged confidently said: &#x201C;The bots will win.&#x201D; MoonMeander believes the humans will have trouble at first, and maybe lose a few matches, but will eventually figure out their draft and strategies to bring it closer to a fifty-fifty shot. Either way, it should be a spectacle for the MOBA ages.</p>","feedlabel":"PC Gamer","date":1534014242,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2454911758745995353","title":"Closing in on The International","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/2454911758745995353","is_external_url":true,"author":"Ward","contents":"[url=http://www.dota2.com/international/overview/][img]http://cdn.dota2.com/apps/dota2/images/blogfiles/ti8_finalcountdown_jbjqw.jpg[/img][/url]\r\n\r\nThe International Group Stage is just five days away, and as we await the crowning event of the Dota 2 competitive season, it's time to check in on some of the final details for those watching the event.\r\n\r\n[b]Tournament News[/b]\r\nAs always, you can check out your in-game Compendium for a complete list of Casters and Talent for this year's event. While you're there, don't forget to fill out your predictions for hero picks, team results, player performance, and tournament meta. Predictions lock before the start of Group Stage play.\r\n\r\nToday we've also launched the [url=http://www.dota2.com/international/overview/]official tournament website for The International 2018[/url], your hub for keeping up with the day-to-day of tournament proceedings. As the Group Stage and Main Event progress, you'll be able to see updated standings and new social media content posted each day from Vancouver.\r\n\r\n[list]\r\n[*]Group Stage: August 15th – August 18th, 2018 – Like last year, two best-of-two groups of nine teams. Top four teams in each group advance to Upper Bracket, four – eight advance to Lower Bracket, bottom in each group is eliminated.[/*]\r\n\r\n[*]Main Event: August 20th – August 25th, 2018 – As before, 16 teams battle through a best-of-three double elimination playoff. Lower bracket first round is best-of-one, Grand Finals are best-of-five.[/*]\r\n[/list]\r\n\r\n[b]Media[/b]\r\nEighteen teams from around the world have earned a place in Vancouver for the final test of the Dota competitive season. Look back on their journeys to the tournament with The International Lowdown videos. Multiple videos are already available with more coming each day as we approach Group Stage. Once the tournament begins, check in on what's happening both on stage and behind the scenes on [url=http://www.dota2.com/international/media/]our media page[/url], which features all content from our [url=https://www.youtube.com/user/dota2]Youtube Channel[/url], [url=https://twitter.com/DOTA2]Twitter[/url] feed, and [url=https://www.instagram.com/dota2ti/]Instagram[/url].\r\n\r\n[b]Newcomer Stream[/b]\r\nHelp friends interested in learning more about Dota understand the tournament flow by sending them to the Newcomer Stream. They'll be able to watch the main broadcast enhanced with contextual overlays that call out information helpful for understanding the intricate world of Dota during the biggest event of the season.\r\n\r\n[b]Pubstomps[/b]\r\nThere’s no better way to enjoy Dota than watching The International with friends. But not every fan can make the journey to Vancouver to witness the tournament in person. To help people around the world connect with each other for their own celebratory Dota events, we’ve once again partnered with Barcraft United to facilitate Pubstomp administration. Just visit the [url=https://www.barcraft.com/ti8/]Barcraft landing page[/url] to find a Pubstomp in your area.","feedlabel":"Community Announcements","date":1533952967,"feedname":"steam_community_announcements","feed_type":1,"appid":570},{"gid":"2454911758744556064","title":"The best free games on Steam","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2454911758744556064","is_external_url":true,"author":"","contents":"<p>If you have the time and hard drive space, you can squeeze a huge amount of free entertainment out of your Steam client. With that in mind we&apos;ve organised the best free and free-to-play games together into one list. The <strong>free games section</strong> consists of games that contain no microtransactions. You might be able to buy extra episodes or DLC packs, but you&apos;ll get the full core experience for your download in this category.</p><p>The <strong>free-to-play section</strong> contains games that are supported by in-game microtransactions. We&apos;ve considered the fairness of the in-game stores when selecting these games, and believe you can get a lot of fun out of them before you put in credit card details. We&apos;ll update the list over time as we discover more gems hidden away in the Steam store.</p>\n<h3>FREE GAMES</h3>\n<h3>Alien Swarm</h3>\n<p></p>\n<p><strong>Link: </strong><a href=\"https://store.steampowered.com/app/630/Alien_Swarm/\" target=\"_blank\">Steam</a></p>\n<p>Up to four players fight through space stations overrun with hordes of alien bugs. Beating missions earns you weapons and equipment that let you specialise your marine. Expect almost Starship Troopers scale hordes at points, as the AI director tries to push your team to the brink of death.</p><p>Alien Swarm is a forgotten Valve experiment, but it&apos;s perfectly good fun in co-op. The complete game code and mod tools are available, but the community never produced enough to sustain the game beyond its opening months. It&apos;s still worth downloading the game with some friends and enjoying what&apos;s there though.</p>\n<h3>A Raven Monologue</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/744810/A_Raven_Monologue/\" target=\"_blank\">Steam</a></p><p>A beautifully drawn experimental short story about a mute raven trying to interact with his townsfolk. The project is described as an attempt &quot;to tell stories or to communicate an experience using a constrained work of interactive art.&quot; It&apos;s quick, simple to play, and full of room for interpretation.</p>\n<h3>Cry of Fear</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/223710/Cry_of_Fear/\" target=\"_blank\">Steam</a></p><p>A quality Half-Life total conversion that&apos;s full of scares. The game twists the old GoldSrc engine to give you an inventory system and a big, dark city to explore. Prepare yourself for relentless tension across eight hours of exploration and combat with 24 different weapons. The download also includes a bunch of custom campaigns and an unlockable extra campaign once you beat the main story. That&apos;s good value for a free download.</p>\n<h3>House of Abandon</h3>\n<p></p>\n<p><strong>Steam:</strong> <a href=\"https://store.steampowered.com/app/558420/Stories_Untold/\" target=\"_blank\">Link</a></p><p>This experiment eventually became the excellent short story compilation Stories Untold. You can still download it to your library by heading to the page linked above and clicking &apos;Download PC Demo&apos;. The first part follows someone playing a text adventure as things start to get strange, and quite scary.</p>\n<h3>Doki Doki Literature Club!</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/698780/Doki_Doki_Literature_Club/\" target=\"_blank\">Steam</a></p><p>It may look like a cheerful classroom drama but don&apos;t be fooled, Doki Doki Literature Club! <a href=\"https://www.pcgamer.com/doki-doki-literature-club-hides-a-gruesome-horror-game-under-its-cute-surface/\" target=\"_blank\">plays with that facade</a>. Sedate chats with classmates create a languid impression for the first act or so, but dark twists await&#x2014;there&apos;s a reason the game opens with a content warning. If you end up enjoying it then you might also like Pony Island and Undertale.&#xA0;</p>\n<h3>Off-Peak</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/467360/OffPeak/\" target=\"_blank\">Steam</a></p><p>It&apos;s the future, you&apos;re stuck in a train station, and everything is weird. Chat with the station&apos;s odd inhabitants and explore its twisted side passages to discover surreal little anecdotes and piece together meaning from the assembled scraps. It only takes about half an hour to complete and the music is sweet, so give it a download.</p>\n<h3>FREE-TO-PLAY GAMES</h3>\n<h3>Dota 2</h3>\n<p></p>\n<p><strong>Link: </strong><a href=\"https://store.steampowered.com/app/570/Dota_2/\" target=\"_blank\">Steam</a></p><p>Dota 2 is one of the biggest games on Steam. Described simply, two teams of five wizards battle to knock over towers and flatten the enemy base in battles that tend to last between 30 minutes and an hour. In practice it&apos;s one of the deepest and most complicated competitive games in the world. Every year the huge International tournament draws millions of viewers, and with 110+ heroes and a consistently shifting meta, this could be the only game you ever need in your Steam library.</p><p>The free-to-play implementation is mostly good. Most microtransactions are tied to cosmetics. In addition to individual item purchases you can also buy battle passes that grant access to modes, quests that you complete by playing games, and more cosmetic items.</p>\n<h3>Warframe</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/agecheck/app/230410/\" target=\"_blank\">Steam</a></p><p>This third person action RPG about futuristic ninjas can be completely baffling for new players, but if you persist with it you&apos;ll find a deep and rewarding game on the verge of some of its most ambitious updates to date. At launch it was a game about repeating short missions&#x2014;and that&apos;s still part of it&#x2014;but there are also open world zones and plans to add co-op space combat. Warframe has been getting better and better in the last few years, and now we reckon it&apos;s one of the <a href=\"https://www.pcgamer.com/warframe-has-quietly-become-the-best-free-to-play-game-on-pc/\" target=\"_blank\">best free to play games on PC</a>.&#xA0;</p><p>You can spend real money to speed up crafting time, and to buy items and frames outright. Everything is perfectly craftable using in-game currency however, and players seem more interested in using the real-money Platinum currency to unlock new colour schemes.</p>\n<h3>Card Hunter</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/293260/Card_Hunter/\" target=\"_blank\">Steam</a></p><p>Card Hunter is a cute squad RPG based around digital collectible cards. You battle through dungeons under the guidance of a dungeon master, levelling up your squad of heroes, building your deck and enjoying some affectionate tongue in cheek digs at D&amp;D along the way. There&apos;s loads to play before you ever see a payment screen and there are also co-op and competitive modes. If only more free-to-play games were like this.</p>\n<h3>Team Fortress 2</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/440/Team_Fortress_2/\" target=\"_blank\">Steam</a></p><p>This team shooter has been around since 2007, but the character designs are timeless and the class design is still magnificent. Few shooters can point to a class as innovative as The Spy, who can disguise himself as an opposing team to sabotage their gadgets and stab their heavies in the back. If you prefer long-range engagements, the sniper has you covered, or you can ambush enemies up close with the Pyro. Whatever your play style, there&apos;s a class to match, and with enough play you will be switching between classes frequently to help your team push the cart or take a tricky point.</p>\n<h3>Path of Exile</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/238960/Path_of_Exile/\" target=\"_blank\">Steam</a></p><p>Path of Exile is one of the deepest action RPGs on the market, and one of the most generous for being free-to-play. The basic structure ought to be familiar: pick a class and embark on Diablo-style killing sprees to earn loot and level up. There&apos;s a huge amount of class and item customisation to dig into as you start to move past the tutorial stages. Slot different patterns of gems into your armour sets to min-max your character and take them into even tougher dungeons. You only need to pay money for cosmetics that reskin your weapons and armour</p>\n<h3>EVE Online</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/8500/EVE_Online/\" target=\"_blank\">EVE Online</a></p><p>This space MMO is famous for producing incredible stories of war and betrayal. Its player-driven corporations are fraught political entities that can be very inaccessible to new players. Even if you don&apos;t persist long enough to break into the grand PvP game it&apos;s still a gorgeous universe full of beautiful spaceships and nebulae. Some ships and skills are locked off in the free-to-play version, but you can spend a huge amount of time in the game before you need to look at paying for premium access.</p>\n<h3>Star Trek Online</h3>\n<p></p>\n<p><strong>Link: </strong><a href=\"https://store.steampowered.com/app/9900/Star_Trek_Online/\" target=\"_blank\">Steam</a></p><p>Fly ships, gather a crew, and beam down to planets with an away team in this massive free-to-play MMO. It has aged quite a bit since launch and it&apos;s riddled with microtransactions, but you can still play through the story and see every side of the game without paying. If you do get drawn in to collecting high end ships and decking out your crew with signature Star Trek livery then expect to pay for it. You can grind for items using in-game currency, but for advance items that will take longer than seems reasonable. If you&apos;re looking for a free Star Trek experience, however, it&apos;s surprisingly fun.</p>\n<h3>Realm Royale</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/813820/Realm_Royale/\" target=\"_blank\">Realm Royale</a></p><p>If you like the idea of Fortnite but can&apos;t stand building, then Realm Royale might be your next battle royale game. It&apos;s still in Early Access, but there are enough features to separate it from Fortnite (which isn&apos;t on Steam), and paid-for battle royale games like PlayerUnknown&apos;s Battlegrounds. Realm Royale has a fantasy element with five classes and different spells and abilities for each. Hunters can leave proximity mines, while mages can heal themselves with ice magic. It&apos;s perfectly playable at this stage in Early Access, but expect it to evolve a lot in the coming months.</p>\n<h3>Battlerite</h3>\n<p></p>\n<p><strong>Link:</strong> <a href=\"https://store.steampowered.com/app/504370/Battlerite/\" target=\"_blank\">Steam</a></p><p>An arena-based top-down brawler with shooting, spells and a colourful art style. As <a href=\"https://www.pcgamer.com/battlerite-is-the-best-teamfight-youve-ever-had-over-and-over/\" target=\"_blank\">we&apos;ve observed before</a>, it&apos;s basically a smartly designed clutch teamfight generator. If you&apos;re tired of the long lanes of Dota 2 or League of Legends then you might enjoy Battlerite&apos;s punchy, fast-paced encounters, and while it&apos;s competitive, it has a cleaner learning curve than the major lane-pushing games. A separate paid-for Battlerite Royale mode is heading to Early Access in September, which has annoyed the community, but you can still find a battle in the original 2v2 and 3v3 modes.</p>","feedlabel":"PC Gamer","date":1533918009,"feedname":"pcgamer","feed_type":0,"appid":440},{"gid":"2454911758738075389","title":"This year's Dota 2 short film contest saw some incredible entries at the last minute","url":"https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/2454911758738075389","is_external_url":true,"author":"","contents":"<p></p>\n<p>Valve opened the gates on the 2018 Dota 2 short film contest at the end of May, and fans of the MOBA wasted no time submitting their videos. Passion aside, it&apos;s not hard to see why: the top submissions will be featured in The International 2018 Battle Pass, and the winners will be shown on-stage at The International itself. There&apos;s also some sizable prize money up for grabs: $25,000 to first place, $10,000 to second place, $5,000 to third place, and $500 to the rest of the top 10.&#xA0;</p><p>There are only a few simple rules on submissions, which you can read in full <a href=\"http://www.dota2.com/international/filmcontestguidelines/\" target=\"_blank\">here</a>. The key points are that entries must be 90 seconds or less, they must be original films created for the contest, and they must pertain to Dota 2. Notably, they &quot;can use any form or combination of animation or live-action,&quot; so using Valve&apos;s popular Source Filmmaker is not a requirement. This year&apos;s entries hit the whole spectrum of techniques, but the past few days in particular have seen some stunning animated films, presumably because animation is hard and these things needed every second in the oven that they could get (the contest entry period closed yesterday morning). Here are four of the best:&#xA0;</p><p><a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1469005364\" target=\"_blank\"><u>Ursa Minor</u></a>, by Alexander Frey and his team.&#xA0;</p>\n<iframe src=\"https://www.youtube.com/embed/JDFAPE9VM5Y\"></iframe>\n<p><a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1468532607\" target=\"_blank\"><u>On The Cliff</u></a>, by Keller Max and his team.&#xA0;</p>\n<iframe src=\"https://www.youtube.com/embed/RGUe_P7albk\"></iframe>\n<p>&#xA0;<a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1468989888\" target=\"_blank\"><u>Kobold Blues</u></a>, by Erick Wright and his team.&#xA0;</p>\n<iframe src=\"https://www.youtube.com/embed/APzeQUjRb8c\"></iframe>\n<p><a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1468327156\" target=\"_blank\"><u>The Final 88 Seconds of an 8-Hour Game</u></a>, also by Erick Wright and his team (multiple submissions are allowed). &#xA0;</p>\n<iframe src=\"https://www.youtube.com/embed/xrPE8ln8F5U\"></iframe>\n<p>A useful roundup of this year&apos;s entries is available <a href=\"https://www.reddit.com/r/DotA2/comments/941rfi/ti8_short_film_contest_entries/\" target=\"_blank\"><u>on the Dota 2 subreddit</u></a>, and you can find more on <a href=\"https://steamcommunity.com/dota2shortfilm/\" target=\"_blank\"><u>the contest&apos;s Steam Community page</u></a>, which is also where you can vote for your favorites. &#xA0;</p>","feedlabel":"PC Gamer","date":1533762086,"feedname":"pcgamer","feed_type":0,"appid":570},{"gid":"2454911758737953910","title":"Dota Pro Circuit Rewind  The International Lowdown","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/2454911758737953910","is_external_url":true,"author":"Ward","contents":"[img]http://cdn.dota2.com/apps/dota2/images/blogfiles/dpc_lowdown_blog.png[/img]\r\n\r\nOne week remains until the first battle horns will sound to kick off Group Stage play at The International, and final preparations are well underway. \r\n \r\nAs the eighteen teams complete their journeys into Vancouver, now is an opportune time to take a look back upon the vastly different roads each has traveled through the Dota Pro Circuit season to arrive at the tournament.\r\n \r\nToday, with the help of one SirActionSlacks, we'll recap all the DPC moments that determined the final standings for the eight direct invites in the new [url=https://www.youtube.com/watch?v=nsfMGbiMIUk&feature=youtu.be]Dota Pro Circuit Rewind[/url]. \r\n \r\nStarting tomorrow, SirActionSlacks will return each day leading up to the Group Stage to help you catch up on everything you need to know about all eighteen teams and their rosters in his week-long series, The International Lowdown. \r\n \r\nTune in daily August 9 - 14 at 10:00 AM PDT on our [url=https://www.youtube.com/user/dota2]Youtube [/url]or [url=https://twitch.tv/dota2ti]Twitch channels[/url] for a new episode. The International Lowdown will feature three teams each day, and viewers on Twitch will also see select classic matches from the archives of The International.\r\n","feedlabel":"Community Announcements","date":1533760712,"feedname":"steam_community_announcements","feed_type":1,"appid":570},{"gid":"2451533424650425097","title":"Dota 2 Update - August 6th, 2018","url":"https://store.steampowered.com/news/42708/","is_external_url":false,"author":"Valve","contents":"* The recent treasure bundle added at level 615 now repeats every 615 levels.<br>* Fixed a bug that could allow Dark Willow to cast both ultimates at the same time","feedlabel":"Product Update","date":1533593220,"feedname":"steam_updates","feed_type":0,"appid":570},{"gid":"2451533424648734624","title":"OpenAI s bots just thrashed some of the world s best Dota players","url":"https://steamstore-a.akamaihd.net/news/externalpost/rps/2451533424648734624","is_external_url":true,"author":"contact@rockpapershotgun.com (Matt Cox)","contents":"<p><img src=\"https://assets.rockpapershotgun.com/images/2018/07/OpenAI_botsheader.jpg/RPSS/resize/670x-1/format/jpg/\" width=\"670\" /></p>\n<p>&#8220;We estimate the probably of winning to be above 95%&#8221;, said OpenAI&#8217;s <a href=\"https://www.rockpapershotgun.com/game/dota-2/\">Dota 2</a> bots at the start of their second game against extremely skilled humans. I knew they&#8217;d been trained up using a sophisticated reinforcement learning technique that had instilled them with millenia worth of experience. I didn&#8217;t know they&#8217;d been versed in trash talk.</p>\n<p>It seems they had training time to spare, because they handily won two out of three games at the &#8220;<a href=\"https://blog.openai.com/openai-five-benchmark/\">OpenAI Five Benchmark</a>&#8221; yesterday. This was the robo-team&#8217;s first outing against non-amateur players, in preparation for the show match they&#8217;ll play at <a href=\"https://www.rockpapershotgun.com/tag/the-international-2018/\">the International 2018</a>. There, they&#8217;ll face off against the best players in the world. The bots won their first game here in 14 minutes, so I don&#8217;t fancy humanity&#8217;s chances.</p>\n<p> <a href=\"https://www.rockpapershotgun.com/2018/08/06/openais-bots-just-thrashed-some-of-the-worlds-best-dota-players/#more-575763\" class=\"more-link\"><span aria-label=\"Continue reading OpenAI&#8217;s bots just thrashed some of the world&#8217;s best Dota players\">(more&hellip;)</span></a></p>\n","feedlabel":"Rock, Paper, Shotgun","date":1533553171,"feedname":"rps","feed_type":0,"appid":570}],"count":1805}}